crypto_wallet/app/controllers/coins_controller.rb

  def create
    @coin = Coin.new(coin_params)

    respond_to do |format|
      if @coin.save
---
INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @coin.update(coin_params)
---
UPDATE "coins" SET "updated_at" = ?, "mining_type_id" = ? WHERE "coins"."id" = ?  [["updated_at", "2023-03-08 00:58:53.692384"], ["mining_type_id", 2], ["id", 2]]