crypto_wallet/app/controllers/mining_types_controller.rb

  def index
    @mining_types = MiningType.all
---
SELECT "mining_types".* FROM "mining_types"

  def create
    @mining_type = MiningType.new(mining_type_params)

    respond_to do |format|
      if @mining_type.save
---
INSERT INTO "mining_types" ("description", "acronym", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", nil], ["acronym", "teste"], ["created_at", "2023-03-10 23:42:54.356636"], ["updated_at", "2023-03-10 23:42:54.356636"]]

  def destroy
    @mining_type.destroy
---
DELETE FROM "mining_types" WHERE "mining_types"."id" = ?  [["id", 4]]

    def set_mining_type
      @mining_type = MiningType.find(params[:id])
---
SELECT "mining_types".* FROM "mining_types" WHERE "mining_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]